Tekla Open API Reference for Tekla Structures 2025
GraphicObjectAttributes Methods
The GraphicObject.GraphicObjectAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Inherited from AttributesBase.)
LoadAttributes
 Loads the attributes from the specified file.
 (Inherited from AttributesBase.)
Top
See Also
Reference
GraphicObject.GraphicObjectAttributes Class
Tekla.Structures.Drawing Namespace